Enums/ВидыДополнительныхВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеСпискаСМСРассылки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорСКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДоговорСКлиентом</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКФайлуИсточнику</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиПостроителяДляОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеВнешнейОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяПечатнаяФорма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтбораПостроителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПараметрыОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНастроекОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныПечати</Name>
			<Comment>Шаблоны печати в формате MS Word</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьБезПредварительногоПросмотра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭкземпляров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередФормированием</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВводитсяВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтандартныйАлгоритм</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПакетыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПакетыПечати</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоВызоваСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВызоваПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаПринтер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПакета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключатьВПакет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовДляПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзменяетДанные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расшифровка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаВнешнююОбработку</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПечатнойФормы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДополнительныхВнешнихОбработок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолЭкз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПечатьДокументовСервер/Ext/Module.bsl
// Функция - Печать сервер
//
// Параметры:
//  Ссылка			 - ЛюбаяСсылка	 - ссылка на объект, печать окторого требуется выполнить.
//  Расшифровка				 - Структура	 - имя печатной формы.
//  КоличествоЭкземпляров	 - Число		 - экземпляров.
//  НаПринтер				 - Булево	 - 
// 
// Возвращаемое значение:
//  Структура - данные сформированной печатной формы.
//
Функция ПечатьСервер(Ссылка, Расшифровка, КоличествоЭкземпляров, НаПринтер) Экспорт
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") 
		Или ТипЗнч(Расшифровка) = Тип("Структура")
	Тогда
		Возврат ПечатьДокумента(Ссылка, Расшифровка, , НаПринтер)
	КонецЕсли;	
	
КонецФункции	

Функция ПечатьДокумента(СсылкаНаОбъект, ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь)
	
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		МенеджерОбъекта = Документы[МетаданныеОбъекта.Имя];
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		МенеджерОбъекта = Справочники[МетаданныеОбъекта.Имя];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = МенеджерОбъекта.Печать(СсылкаНаОбъект, ИмяМакета);
	ПолныйПутьКМакету = СсылкаНаОбъект.Метаданные().ПолноеИмя() + "." + ИмяМакета;
	СинонимМакета = Строка(СсылкаНаОбъект);
	
	Попытка
		СтруктураПечатныхФорм = МенеджерОбъекта.ПолучитьСтруктуруПечатныхФорм();
		СтруктураПечатныхФорм.Свойство(ИмяМакета, СинонимМакета);
	Исключение КонецПопытки;
	
	Возврат УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДокумент, 
															КоличествоЭкземпляров, 
															НаПринтер, 
															СсылкаНаОбъект, 
															СсылкаНаОбъект,
															,
															ИмяМакета,
															ПолныйПутьКМакету,
															СинонимМакета);

КонецФункции

// Напечатать печатную форму по умолчанию объекта.
//
// Параметры:
//  Ссылка	 - ЛюбаяСсылка	 - объект печати.
// 
// Возвращаемое значение:
//  Структура - данные сформированной печатной формы.
//
Функция НапечататьДокументПоУмолчаниюСервер(Ссылка) Экспорт
	Результат = УниверсальныеМеханизмыСервер.НапечататьДокументПоУмолчанию(Ссылка);
	Возврат Результат;
КонецФункции

// Получает имя печатной формы документа по умолчанию
//
// Параметры:
//  ПолноеИмяОбъекта	 - Строка - полное имя объекта метаданных.
// 
// Возвращаемое значение:
//  Строка. 
//
Функция ПечатнаяФормаОбъектаПоУмолчанию(ПолноеИмяОбъекта)
	
	ОписаниеФормы = Новый Структура("ПечатнаяФорма, Представление");
	
	ТипОбъекта = СтрРазделить(ПолноеИмяОбъекта, ".")[0];
	ИмяОбъекта = СтрРазделить(ПолноеИмяОбъекта, ".")[1];
	
	ПечатныеФормыОбъекта = ПечатныеФормыОбъектаКонфигурации(ПолноеИмяОбъекта);
	Если ПечатныеФормыОбъекта = Неопределено Тогда
		Возврат ОписаниеФормы; // Нет возможности определить форму.
	КонецЕсли;
	
	ИмяНастройки = ?(ТипОбъекта = "Документ","",ТипОбъекта) + ИмяОбъекта; 
	
	ПФ_Хранилище = ХранилищеПользовательскихНастроекОтчетов.Загрузить(ИмяНастройки, "ПечатнаяФорма");
	ПФ_ПоУмолчанию = Неопределено;
	
	Если ЗначениеЗаполнено(ПФ_Хранилище) Тогда
		
		ПечатнаяФормаНайдена = Ложь;
		
		// Перебор встроенных печатных форм для поддержки формата "до мая 2024" в том же алгоритме.
		Для Каждого ОписаниеПечатнойФормы Из ПечатныеФормыОбъекта Цикл
			
			Если ТипЗнч(ОписаниеПечатнойФормы.ПечатнаяФорма) = Тип("Строка") Тогда // Это встроенная печатная форма.
				
				// По имени встроенной ПФ (с мая 2024)
				Если ПФ_Хранилище = ОписаниеПечатнойФормы.ПечатнаяФорма Тогда
					ПФ_ПоУмолчанию = ОписаниеПечатнойФормы;
					Прервать;
				КонецЕсли;
				
				// По наименованию ПФ (до мая 2024)
				Если ПФ_Хранилище = ОписаниеПечатнойФормы.Представление Тогда
					ПФ_ПоУмолчанию = ОписаниеПечатнойФормы;
					Прервать;
				КонецЕсли;
				Если ПечатнаяФормаНайдена Тогда Прервать; КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		// Перебор добавленных.
		Если ПФ_ПоУмолчанию = Неопределено Тогда
			Для Каждого ОписаниеПечатнойФормы Из ПечатныеФормыОбъекта Цикл
				
				Если ТипЗнч(ОписаниеПечатнойФормы.ПечатнаяФорма) <> Тип("Строка") Тогда // Это добавленная печатная форма (справочник).
					
					ТипЗначенияВХранилище = ТипЗнч(ПФ_Хранилище);
					// Проверяем, та это печатная форма или нет.
					Если	(ТипЗначенияВХранилище = Тип("Строка") И ПФ_Хранилище = Строка(ОписаниеПечатнойФормы.ПечатнаяФорма))
						Или (ОбщегоНазначения.ЭтоСсылка(ТипЗначенияВХранилище) И ПФ_Хранилище = ОписаниеПечатнойФормы.ПечатнаяФорма)
					Тогда
						ПФ_ПоУмолчанию = ОписаниеПечатнойФормы;
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ПФ_ПоУмолчанию = Неопределено Тогда
			ХранилищеПользовательскихНастроекОтчетов.Удалить(ИмяНастройки,"ПечатнаяФорма", ИмяПользователя());
		КонецЕсли;
	Иначе
		// В хранилище нет формы по умолчанию, берём первую.
		Если ПечатныеФормыОбъекта.Количество() <> 0 Тогда
			ПФ_ПоУмолчанию = ПечатныеФормыОбъекта[0];
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПФ_ПоУмолчанию;
	
КонецФункции

Функция ПечатныеФормыОбъектаКонфигурации(ПолноеИмяМетаданных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяМетаданных);
		ПустаяСсылка = МенеджерОбъекта.ПустаяСсылка();

		Возврат ПараметрыСеанса.ПечатныеФормы.Получить(ПустаяСсылка);
	Исключение КонецПопытки;

	Возврат Новый Массив;
	
КонецФункции

// Невстроенные печатные формы объектов конфигурации (внешние, пакеты, привязанные шаблоны печати)
Процедура ЗаполнитьПараметрСеансаПечатныеФормы()
	
	УстановитьПривилегированныйРежим(Истина);
	ПечатныеФормы = Новый Соответствие; // Ключ - пустая ссылка, Значение - структура описания.
			ПараметрыСеанса.ПечатныеФормы = Новый ФиксированноеСоответствие(ПечатныеФормы);
	
	РазрешенныеОбладателиПФ = РазрешенныеОбладателиПечатныхФорм();
	Для Каждого ИмяМетаданныхОбладателя Из РазрешенныеОбладателиПФ Цикл
		Попытка
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяМетаданныхОбладателя);
			ВстроенныеПечатныеФормыОбъекта = МенеджерОбъекта.ПолучитьСтруктуруПечатныхФорм();
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ВстроенныеПечатныеФормыОбъекта.Количество() <> 0 Тогда
			ПечатныеФормыОбъекта = Новый Массив;
			Для Каждого ВстроеннаяПечатнаяФорма Из ВстроенныеПечатныеФормыОбъекта Цикл
				СтруктураПечатнойФормы = Новый Структура("ПечатнаяФорма, Представление, ЗаменяемаяПечатнаяФорма",
														 ВстроеннаяПечатнаяФорма.Ключ, ВстроеннаяПечатнаяФорма.Значение);
				ПечатныеФормыОбъекта.Добавить(Новый ФиксированнаяСтруктура(СтруктураПечатнойФормы));
			КонецЦикла;
			
			ПечатныеФормы.Вставить(МенеджерОбъекта.ПустаяСсылка(), Новый ФиксированныйМассив(ПечатныеФормыОбъекта));
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидОбработкиПечатнаяФорма", Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма); 
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеОбработкиПринадлежность.Ссылка КАК ПечатнаяФорма,
	|	ВнешниеОбработкиПринадлежность.ПредставлениеКнопки КАК Представление,
	|	ВнешниеОбработкиПринадлежность.ЗаменяемаяПечатнаяФорма КАК ЗаменяемаяПечатнаяФорма,
	|	ВнешниеОбработкиПринадлежность.СсылкаОбъекта КАК СсылкаОбъекта,
	|	ВнешниеОбработкиПринадлежность.Ссылка.Наименование КАК НаименованиеВнешнейОбработки
	|ИЗ
	|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	|ГДЕ
	|	ВнешниеОбработкиПринадлежность.Ссылка.ВидОбработки = &ВидОбработкиПечатнаяФорма
	|	И НЕ ВнешниеОбработкиПринадлежность.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ШаблоныПечатиПринадлежность.Ссылка,
	|	ШаблоныПечатиПринадлежность.Ссылка.Представление,
	|	"""",
	|	ШаблоныПечатиПринадлежность.СсылкаОбъекта,
	|	""""
	|ИЗ
	|	Справочник.ШаблоныПечати.Принадлежность КАК ШаблоныПечатиПринадлежность
	|ГДЕ
	|	НЕ ШаблоныПечатиПринадлежность.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПакетыПечати.Ссылка,
	|	ПакетыПечати.Представление,
	|	"""",
	|	ПакетыПечати.МестоВызоваСсылка,
	|	""""
	|ИЗ
	|	Справочник.ПакетыПечати КАК ПакетыПечати
	|ГДЕ
	|	НЕ ПакетыПечати.Ссылка.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СсылкаОбъекта
	|ИТОГИ ПО
	|	СсылкаОбъекта";
	
	ВыборкаВладелец = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВладелец.Следующий() Цикл
		
		СсылкаОбъекта = ВыборкаВладелец.СсылкаОбъекта;
		
		фмПечатныеФормыОбъекта = ПечатныеФормы.Получить(СсылкаОбъекта);
		Если фмПечатныеФормыОбъекта = Неопределено Тогда
			ПечатныеФормыОбъекта = Новый Массив;
		Иначе
			ПечатныеФормыОбъекта = Новый Массив(фмПечатныеФормыОбъекта);
		КонецЕсли;
		
		Выборка = ВыборкаВладелец.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураПечатнойФормы = Новый Структура("ПечатнаяФорма, Представление, ЗаменяемаяПечатнаяФорма");
	        СтруктураПечатнойФормы.ПечатнаяФорма = Выборка.ПечатнаяФорма;
			СтруктураПечатнойФормы.Представление = Выборка.Представление;
			
			Если ЗначениеЗаполнено(Выборка.ЗаменяемаяПечатнаяФорма) Тогда
				СтруктураПечатнойФормы.ЗаменяемаяПечатнаяФорма = Выборка.ЗаменяемаяПечатнаяФорма;
				
				Если ПустаяСтрока(СтруктураПечатнойФормы.Представление) Тогда
					// Наименование определяем из встроенной формы, уже добавленной в массив описаний форм
					Для Каждого ВнутренняяПечатнаяФорма Из ПечатныеФормыОбъекта Цикл
						Если ВнутренняяПечатнаяФорма.ПечатнаяФорма = СтруктураПечатнойФормы.ЗаменяемаяПечатнаяФорма Тогда
							СтруктураПечатнойФормы.Представление = ВнутренняяПечатнаяФорма.Представление;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			ИначеЕсли ПустаяСтрока(СтруктураПечатнойФормы.Представление)
					И ТипЗнч(Выборка.ПечатнаяФорма) = Тип("СправочникСсылка.ВнешниеОбработки")
			Тогда
				СтруктураПечатнойФормы.Представление = Выборка.НаименованиеВнешнейОбработки;
			КонецЕсли;	
			
			ПечатныеФормыОбъекта.Добавить(Новый ФиксированнаяСтруктура(СтруктураПечатнойФормы));
		КонецЦикла;
		
		ПечатныеФормы.Вставить(СсылкаОбъекта, Новый ФиксированныйМассив(ПечатныеФормыОбъекта));
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПечатныеФормы = Новый ФиксированноеСоответствие(ПечатныеФормы);
	
КонецПроцедуры

// Имена метаданных документов и справочников, которые могут иметь печатные формы.
Функция РазрешенныеОбладателиПечатныхФорм()
	
	РазрешенныеОбладателиПФ = Новый Массив;
	
	// Документы
	МетаданныеДокументы = Метаданные.Документы;
	Для Каждого ДокументТип Из Метаданные.ОпределяемыеТипы.ТипПараметраКомандПечати.Тип.Типы() Цикл
		
		Документ = ОбщегоНазначения.ПустоеЗначениеТипа(ДокументТип).Метаданные();
		Если МетаданныеДокументы.Содержит(Документ) Тогда
			РазрешенныеОбладателиПФ.Добавить(Документ.ПолноеИмя());
		КонецЕсли;
	КонецЦикла;	
	
	// Справочники
	МетаданныеСправочники = Метаданные.Справочники;
	РазрешенныеОбладателиПФ.Добавить(МетаданныеСправочники.Клиенты.ПолноеИмя());
	
	Возврат РазрешенныеОбладателиПФ;
	
КонецФункции

// Формирует кэши печатных форм
// 
// Возвращаемое значение:
//  Массив.
//
Функция ЗаполнитьКэшПечатныхФорм() Экспорт
	
	ЗаполнитьПараметрСеансаПечатныеФормы();
	
	МассивВозврата = Новый Массив;
	
	РазрешенныеОбладателиПФ = РазрешенныеОбладателиПечатныхФорм(); // Имена метаданных документов и справочников, которые могут иметь печатные формы.
	
	МетаданныеДокументы = Метаданные.Документы;
	Для Каждого ИмяМетаданныхОбладателя Из РазрешенныеОбладателиПФ Цикл
		
		ОписаниеПечатнойФормы = ПечатнаяФормаОбъектаПоУмолчанию(ИмяМетаданныхОбладателя);
		
		Если ОписаниеПечатнойФормы <> Неопределено Тогда
		    Структура = Новый Структура("ИмяОбъекта, ПечатнаяФорма, Представление");
			Структура.ИмяОбъекта = ИмяМетаданныхОбладателя;
			Структура.ПечатнаяФорма	= ОписаниеПечатнойФормы.ПечатнаяФорма;
			Структура.Представление = ОписаниеПечатнойФормы.Представление;
			МассивВозврата.Добавить(Структура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Встроенные печатные формы объекта метаданных из кеша
//
// Параметры:
//  ПолноеИмяМетаданных	 - Строка - полное имя метаданных объекта.
// 
// Возвращаемое значение:
//  Структура - перечень печатных форм с представлениями.
//
Функция ВстроенныеПечатныеФормыОбъекта(ПолноеИмяМетаданных) Экспорт
	
	СтруктураПечатныхФорм = Новый Структура;
	
	ПечатныеФормыОбъекта = ПечатныеФормыОбъектаКонфигурации(ПолноеИмяМетаданных);
	Для Каждого ОписаниеПечатнойФормы Из ПечатныеФормыОбъекта Цикл
		Если ТипЗнч(ОписаниеПечатнойФормы.ПечатнаяФорма) = Тип("Строка") Тогда // Встроенная.
			СтруктураПечатныхФорм.Вставить(ОписаниеПечатнойФормы.ПечатнаяФорма, ОписаниеПечатнойФормы.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПечатныхФорм;
	
КонецФункции

// Возвращает доступные варианты печати документа.
//  Результат:	Структура, каждая строка которой соответствует одному из вариантов печати.
//
// Параметры:
//  ИмяОбъекта	 - Строка, ДокументСсылка - имя объекта метаданных или ссылка его типа.
//  ТипОбъекта	 - Строка	 - "Документ" или "Справочник".
// 
// Возвращаемое значение:
//  Структура - печатные формы объекта.
//
Функция ПолучитьСтруктуруПечатныхФормСервер(ИмяОбъекта, ТипОбъекта = "Документ") Экспорт
	
	Если ТипЗнч(ИмяОбъекта) = Тип("Строка") Тогда
		ПолноеИмяОбъекта = ТипОбъекта + "." + ИмяОбъекта;
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ИмяОбъекта)) Тогда
		ПолноеИмяОбъекта = ИмяОбъекта.Метаданные().ПолноеИмя();
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
	Возврат ВстроенныеПечатныеФормыОбъекта(ПолноеИмяОбъекта);
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедуры печати для пакета документов
//
// Параметры:
//  Пакет	 - СправочникСсылка.ПакетыПечати	 - пакет.
//  Источник - ДокументСсылка	 - документ.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ПолучитьСоставПакета(Пакет,Источник) Экспорт 

	КлиентИсточника = Справочники.Клиенты.ПустаяСсылка();
	Попытка
		ИсточникОбъект = Источник.ПолучитьОбъект();
		
		Если Метаданные.Документы.Содержит(ИсточникОбъект.Метаданные()) Тогда 
			Если ОбщегоНазначения.ЕстьРеквизитДокумента("Клиент", ИсточникОбъект.Метаданные()) Тогда 
				КлиентИсточника = Источник.Клиент;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛОЖЬ КАК Печатать,
	|	ДоговорСКлиентом.ВидДоговора
	|ПОМЕСТИТЬ ДоговорыСКлиентом
	|ИЗ
	|	Документ.ДоговорСКлиентом КАК ДоговорСКлиентом
	|ГДЕ
	|	ДоговорСКлиентом.Клиент = &Клиент
	|	И ДоговорСКлиентом.Проведен
	|	И НЕ ДоговорСКлиентом.ПометкаУдаления
	|	И (ДоговорСКлиентом.ДатаОкончания >= &Дата
	|			ИЛИ ДоговорСКлиентом.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетыПечатиСостав.ПредставлениеОбъекта,
	|	ПакетыПечатиСостав.ВидОбъекта,
	|	ПакетыПечатиСостав.КолЭкз КАК КолЭкз,
	|	ПакетыПечатиСостав.СсылкаОбъекта,
	|	ПакетыПечатиСостав.Имя,
	|	ПакетыПечатиСостав.СсылкаНаВнешнююОбработку,
	|	ПакетыПечатиСостав.ЗаменяемаяПечатнаяФорма,
	|	ПакетыПечатиСостав.Расшифровка,
	|	ПакетыПечатиСостав.ВидПечатнойФормы,
	|	ПакетыПечатиСостав.Действие,
	|	ПакетыПечатиСостав.Текст,
	|	ЕСТЬNULL(ДоговорыСКлиентом.Печатать, ИСТИНА) КАК Печатать,
	|	ПакетыПечатиСостав.ВключатьВПакет
	|ИЗ
	|	Справочник.ПакетыПечати.СоставПакета КАК ПакетыПечатиСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыСКлиентом КАК ДоговорыСКлиентом
	|		ПО ПакетыПечатиСостав.ПредставлениеОбъекта = ДоговорыСКлиентом.ВидДоговора
	|ГДЕ
	|	ПакетыПечатиСостав.Ссылка В(&Пакет)
	|	И НЕ ПакетыПечатиСостав.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Клиент", КлиентИсточника);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Пакет", Пакет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
		
КонецФункции

// Функция - Получить печатную форму
//
// Параметры:
//  СсылкаНаОбъект	 - ЛюбаяСсылка	 - объект.
//  ИмяМакета		 - Строка	 - имя формы.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
//
Функция ПолучитьПечатнуюФорму(СсылкаНаОбъект,ИмяМакета) Экспорт
	МетаданныеОбъекта = СсылкаНаОбъект.Метаданные();
	Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
		Возврат Документы[МетаданныеОбъекта.Имя].Печать(СсылкаНаОбъект, ИмяМакета);
	ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		Возврат Справочники[МетаданныеОбъекта.Имя].Печать(СсылкаНаОбъект, ИмяМакета);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьТабДок(КоллекцияПечатныхФорм, КолЭкз, СсылкаНаОбъект, ИмяМакета, ПредставлениеМакета, РезультатПечати = Неопределено) Экспорт
	
	Если РезультатПечати <> Неопределено Тогда 
		ПечФорма = РезультатПечати;
	Иначе
		ПечФорма = ПолучитьПечатнуюФорму(СсылкаНаОбъект, ИмяМакета);
	КонецЕсли;

	Если ТипЗнч(ПечФорма) = Тип("ТабличныйДокумент") Тогда
		
		УниверсальныеМеханизмыСервер.ДобавитьДокументВКоллекциюПечатныхФорм(КоллекцияПечатныхФорм, ПечФорма, ИмяМакета, ПредставлениеМакета, КолЭкз);
		
	ИначеЕсли ТипЗнч(ПечФорма) = Тип("Массив") Тогда
		// Обойдем все вложенные табдоки и добавим каждый из них в коллекцию
		Для Каждого СтрПечФорма Из ПечФорма Цикл
			Если ТипЗнч(СтрПечФорма.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
				
				УниверсальныеМеханизмыСервер.ДобавитьДокументВКоллекциюПечатныхФорм(КоллекцияПечатныхФорм, СтрПечФорма.ТабличныйДокумент, СтрПечФорма.ИмяМакета, СтрПечФорма.СинонимМакета, КолЭкз * СтрПечФорма.Экземпляров);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Создать договор на сервере
//
// Параметры:
//  ВидДоговора	 - СправочникСсылка.ВидыДоговоров - вид договора.
//  Источник	 - ДокументСсылка, СправочникСсылка.Клиенты - то, для чего создается договор.
// 
// Возвращаемое значение:
//  ДокументСсылка.ДоговорСКлиентом
//
Функция СоздатьДоговорНаСервере(ВидДоговора, Источник) Экспорт     
	
	ДоговорОбъект = Неопределено;

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ДоговорСКлиентом.Ссылка
	                      |ИЗ
	                      |	Документ.ДоговорСКлиентом КАК ДоговорСКлиентом
	                      |ГДЕ
	                      |	ДоговорСКлиентом.Клиент = &Клиент
	                      |	И ДоговорСКлиентом.ВидДоговора = &ВидДоговора
	                      |	И НЕ ДоговорСКлиентом.Завершен
	                      |	И ДоговорСКлиентом.Проведен");
						  
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Клиенты") Тогда 
		Запрос.УстановитьПараметр("Клиент",Источник);	
	Иначе 
		Запрос.УстановитьПараметр("Клиент",Источник.Клиент);
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидДоговора",ВидДоговора);
	Выборка = Запрос.Выполнить();
	Если Не Выборка.Пустой() Тогда 
		ВыборкаДокумент = Выборка.Выбрать();
		Если ВыборкаДокумент.Следующий() Тогда 
			Возврат ВыборкаДокумент.Ссылка;
		КонецЕсли;
	КонецЕсли;

	Если ДоговорОбъект = Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		ДоговорОбъект = Документы.ДоговорСКлиентом.СоздатьДокумент(); 
		ДоговорОбъект.Заполнить(Источник);							// Используем стандартное заполнение документа   
		ДоговорОбъект.ВидДоговора = ВидДоговора;                    // Назначим ему вид договора
		
		ДоговорОбъект.Номер			= "";
		ДоговорОбъект.Дата			= ТекущаяДата();
		ДоговорОбъект.Ответственный	= ПараметрыСеанса.ТекущийПользователь;
		ДоговорОбъект.Филиал			= УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
		
		ДоговорОбъект.Записать(РежимЗаписиДокумента.Проведение);    // Проведем документ
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ДоговорОбъект.Ссылка;
	
КонецФункции

// Функция - Передать состав в клиент
//
// Параметры:
//  Пакет	 - СправочникСсылка.ПакетыПечати	 - пакет
//  Источник - ДокументСсылка	 - объект печати.
//  ТЗ		 - ТаблицаЗначений - таблица с составом пакета.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ПередатьСоставВКлиент(Пакет = Неопределено,Источник = Неопределено, ТЗ = Неопределено) Экспорт
	
    Перем РезультатМассив;
    Перем СтруктураСтрока;
	
	Если Пакет <> Неопределено И Источник <> Неопределено Тогда 
		ТаблицаЗначений = ПолучитьСоставПакета(Пакет,Источник);
	Иначе 
		ТаблицаЗначений = ТЗ;
	КонецЕсли;
	
    РезультатМассив = Новый Массив;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        СтруктураСтрока = Новый Структура;
        Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
            СтруктураСтрока.Вставить(Колонка.Имя, Строка[Колонка.Имя]);
		КонецЦикла;
		СтруктураСтрока.Вставить("Пакет", Пакет);
        РезультатМассив.Добавить(СтруктураСтрока);
    КонецЦикла;

    Возврат РезультатМассив;

КонецФункции

//  Ссылка			 - ЛюбаяСсылка	 - ссылка на объект, печать окторого требуется выполнить.
//  Расшифровка				 - Структура	 - имя печатной формы.
//  КоличествоЭкземпляров	 - Число		 - экземпляров.
//  НаПринтер				 - Булево	 - вывести ли сразу на принтер (если возможно)
//
// Параметры:
//  Объект			 - ЛюбаяСсылка	 - ссылка на объект, печать окторого требуется выполнить.
//  Расшифровка		 - Структура	 - дополнительные параметры.
//  ДокСсылка		 - ЛюбаяСсылка	 - ссылка на объект, печать окторого требуется выполнить.
//  МенеджерПечати	 - ДокументМенеджер	 - менеджер печатаемого объекта.
//  СтрокаКнопки	 - Структура	 - данные команды печати.
// 
// Возвращаемое значение:
//  Структура - данные печатной формы.
//
&НаСервере
Функция ВывестиНапечататьДокумент(Объект, Расшифровка, ДокСсылка, МенеджерПечати, СтрокаКнопки) Экспорт
	
	Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ВнешниеОбработки") Тогда        // Проверить принаджежность и доп реквизиты
		
		стрРасшифровка = новый Структура;
		стрРасшифровка.Вставить("ВидПечатнойФормы", СтрокаКнопки.ВидПечатнойФормы);
		стрРасшифровка.Вставить("СсылкаНаВнешнююОбработку", СтрокаКнопки.СсылкаНаВнешнююОбработку);
		стрРасшифровка.Вставить("ЗаменяемаяПечатнаяФорма", СтрокаКнопки.ЗаменяемаяПечатнаяФорма);
		стрРасшифровка.Вставить("ОбъектПечати", ДокСсылка);
		
		РезультатПечати = НапечататьВнешнююФормуСПроверкойРежима(Объект, стрРасшифровка);
		Если ТипЗнч(РезультатПечати) = Тип("ТабличныйДокумент") Тогда
			ТабДокумент = РезультатПечати;
			ЭтоДокумент = Найти(МенеджерПечати,"Документ") <> 0;
			СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДокумент, 0, Ложь, ?(ЭтоДокумент, 
			ОбщегоНазначенияСервер.СформироватьЗаголовокДокумента(ДокСсылка[0]), Строка(ДокСсылка[0])), 
			ДокСсылка[0], Расшифровка);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ШаблоныПечати") Тогда
		
		Возврат Неопределено;
		// ШаблонПечати = СтрокаКнопки.СсылкаНаВнешнююОбработку;
		
	ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда
		СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка[0]);
		//СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета, ДокСсылка, СтрокаКнопки.СсылкаНаВнешнююОбработку, Ложь);
	КонецЕсли;
	
	Возврат СтруктураНаПечать;
		
КонецФункции

&НаСервере
Функция НапечататьВнешнююФормуСПроверкойРежима(Объект, стрРасшифровка)
	
	Рез = УниверсальныеМеханизмыСервер.РежимЗапускаОбработки(Объект, стрРасшифровка);
	
	Если ТипЗнч(Рез) = Тип("Строка") Тогда
		Попытка
			ФормаНаОткрытие = "ВнешняяОбработка."+Рез+".Форма.Форма1";
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить печатную форму" + Символы.ПС + Строка(ОписаниеОшибки()));
		КонецПопытки;	
		Возврат Неопределено;
	Иначе
		ТабДокумент = УниверсальныеМеханизмыСервер.НапечататьВнешнююФорму(Объект, стрРасшифровка);
		Возврат ТабДокумент;	
	КонецЕсли;	
	
КонецФункции
//-ОЛИМП
